03-Res-Latency-hotel-2profile-better/Res-firecracker-set-v1/firecracker_t_10_c_30_frontVcpu_4_wrkVcpu_1_R_3700/wrk.txt
Running 2m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 27.120ms, rate sampling interval: 134ms
  Thread calibration: mean lat.: 34.343ms, rate sampling interval: 185ms
  Thread calibration: mean lat.: 30.470ms, rate sampling interval: 160ms
  Thread calibration: mean lat.: 42.330ms, rate sampling interval: 221ms
  Thread calibration: mean lat.: 26.876ms, rate sampling interval: 135ms
  Thread calibration: mean lat.: 26.695ms, rate sampling interval: 116ms
  Thread calibration: mean lat.: 37.731ms, rate sampling interval: 199ms
  Thread calibration: mean lat.: 32.044ms, rate sampling interval: 171ms
  Thread calibration: mean lat.: 37.591ms, rate sampling interval: 206ms
  Thread calibration: mean lat.: 30.261ms, rate sampling interval: 142ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.80ms   20.67ms  98.24ms   88.00%
    Req/Sec   371.68     48.76   491.00     68.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.30ms
 75.000%   25.92ms
 90.000%   44.32ms
 99.000%   98.24ms
 99.900%  170.37ms
 99.990%  223.74ms
 99.999%  241.92ms
100.000%  244.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.616     0.000000            1         1.00
       3.197     0.100000        40835         1.11
       5.051     0.200000        81633         1.25
       7.355     0.300000       122406         1.43
      10.087     0.400000       163192         1.67
      13.295     0.500000       204016         2.00
      15.167     0.550000       224385         2.22
      17.247     0.600000       244819         2.50
      19.663     0.650000       265225         2.86
      22.527     0.700000       285577         3.33
      25.919     0.750000       305932         4.00
      27.919     0.775000       316190         4.44
      30.191     0.800000       326324         5.00
      32.831     0.825000       336565         5.71
      35.903     0.850000       346789         6.67
      39.647     0.875000       356947         8.00
      41.791     0.887500       362007         8.89
      44.319     0.900000       367123        10.00
      47.103     0.912500       372221        11.43
      50.495     0.925000       377309        13.33
      54.559     0.937500       382415        16.00
      56.991     0.943750       384971        17.78
      59.647     0.950000       387509        20.00
      62.815     0.956250       390055        22.86
      66.431     0.962500       392608        26.67
      70.847     0.968750       395160        32.00
      73.535     0.971875       396428        35.56
      76.351     0.975000       397698        40.00
      79.487     0.978125       398977        45.71
      83.071     0.981250       400239        53.33
      87.487     0.984375       401517        64.00
      89.919     0.985938       402156        71.11
      92.927     0.987500       402788        80.00
      96.191     0.989062       403427        91.43
      99.775     0.990625       404066       106.67
     104.575     0.992188       404702       128.00
     107.711     0.992969       405023       142.22
     110.911     0.993750       405341       160.00
     114.943     0.994531       405660       182.86
     119.935     0.995313       405975       213.33
     126.655     0.996094       406298       256.00
     130.879     0.996484       406455       284.44
     135.551     0.996875       406612       320.00
     140.671     0.997266       406773       365.71
     145.791     0.997656       406931       426.67
     150.911     0.998047       407090       512.00
     153.599     0.998242       407171       568.89
     156.927     0.998437       407250       640.00
     160.511     0.998633       407332       731.43
     165.503     0.998828       407411       853.33
     171.775     0.999023       407490      1024.00
     175.359     0.999121       407529      1137.78
     181.631     0.999219       407569      1280.00
     186.495     0.999316       407608      1462.86
     191.487     0.999414       407650      1706.67
     196.735     0.999512       407691      2048.00
     198.143     0.999561       407708      2275.56
     199.551     0.999609       407729      2560.00
     202.367     0.999658       407747      2925.71
     204.415     0.999707       407768      3413.33
     206.591     0.999756       407788      4096.00
     208.767     0.999780       407797      4551.11
     210.559     0.999805       407807      5120.00
     214.015     0.999829       407817      5851.43
     219.007     0.999854       407827      6826.67
     221.439     0.999878       407839      8192.00
     222.591     0.999890       407842      9102.22
     224.895     0.999902       407847     10240.00
     226.303     0.999915       407852     11702.86
     228.479     0.999927       407857     13653.33
     230.143     0.999939       407862     16384.00
     231.167     0.999945       407864     18204.44
     232.703     0.999951       407867     20480.00
     235.007     0.999957       407869     23405.71
     235.391     0.999963       407872     27306.67
     238.079     0.999969       407874     32768.00
     238.463     0.999973       407875     36408.89
     239.359     0.999976       407877     40960.00
     239.615     0.999979       407878     46811.43
     240.255     0.999982       407879     54613.33
     241.023     0.999985       407880     65536.00
     241.791     0.999986       407881     72817.78
     241.919     0.999988       407882     81920.00
     241.919     0.999989       407882     93622.86
     243.199     0.999991       407883    109226.67
     243.199     0.999992       407883    131072.00
     243.839     0.999993       407884    145635.56
     243.839     0.999994       407884    163840.00
     243.839     0.999995       407884    187245.71
     244.351     0.999995       407885    218453.33
     244.351     0.999996       407885    262144.00
     244.351     0.999997       407885    291271.11
     244.351     0.999997       407885    327680.00
     244.351     0.999997       407885    374491.43
     244.991     0.999998       407886    436906.67
     244.991     1.000000       407886          inf
#[Mean    =       19.799, StdDeviation   =       20.669]
#[Max     =      244.864, Total count    =       407886]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  444656 requests in 2.00m, 184.04MB read
Requests/sec:   3705.46
Transfer/sec:      1.53MB